org/final/gabriel-marin.tex
% Created 2024-10-06 Sun 12:55
% Intended LaTeX compiler: xelatex
\documentclass[a4paper,12pt]{article}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{fontspec}
\setmainfont{Open Sans}
\pagenumbering{gobble}
\usepackage[big]{layaureo} % better A4 formating
\usepackage{titlesec} % custom \section
\usepackage{url,parskip} % packages for formating
\usepackage{multicol} % multiples columns
\usepackage{ragged2e} % for alignment
\usepackage{color}
\usepackage{graphicx}
\usepackage{svg}
\usepackage{hyperref}
\usepackage{array} % for table alignment
\newcolumntype{L}[1]{>{\raggedright\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
\newcolumntype{C}[1]{>{\centering\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
\newcolumntype{R}[1]{>{\raggedleft\let\newline\\\arraybackslash\hspace{0pt}}m{#1}}
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks,urlcolor=linkcolour, linkcolor=linkcolour}
\titleformat{\section}{\LARGE\center}{\thesection}{}{}
\titlespacing{\section}{0pt}{4pt}{0pt}
\setlength{\columnsep}{1cm} % space between columns
\titleformat{\subsection}{\large\center}{\thesubsection}{}{}
\titlespacing{\subsection}{0pt}{1pt}{1pt}
\titleformat{\subsubsection}{\normalsize\scshape\raggedright}{\thesubsubsection}{1em}{}
\titlespacing{\subsubsection}{0pt}{1pt}{1pt}
\date{}
\title{}
\hypersetup{
 pdfauthor={gbrlmarn},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}


\section*{\textbf{Gabriel Marin}}
\label{sec:org0b2e11d}
\begin{center}
\begin{tabular}{c|c|c}
\href{mailto:marin.gabriel@protonmail.com}{marin.gabriel@protonmail.com} & \href{https://github.com/gbrlmarn}{github.com/gbrlmarn} & \href{https://linkedin.com/in/maringabriel}{linkedin.com/in/maringabriel}\\
\end{tabular}
\end{center}
\subsection*{\textbf{Work Experience}}
\label{sec:orgab1303b}
\begin{tabular}{{L{14cm}R{3cm}}}
\textbf{Luxoft}, Software Engineer & 2022 -- Present\\
• Maintained project building environment using CMake. & \\
• Done socket programming using ZeroMQ library in C/C++. & \\
• Automated environment configuration using Docker and Bash. & \\
• Created integration tests using Golang and Clojure. & \\
• Developed command line interface for sending/receiving messages. & \\
• Developed certificate viewer in C++ using OpenSSL API. & \\
• Refactored multiple repositories according to coding guidelines. & \\
 & \\
\textbf{Continental}, Software Engineer & 2021 -- 2022\\
• Worked on XML generator using Java and \emph{AUTOSAR} library. & \\
• Converted JSON to XML data using Python. & \\
 & \\
\textbf{Ministry of Internal Affairs}, System Engineer & 2019 -- 2021\\
• Developed scripts for task automation with PowerShell. & \\
• Deployed and configured Radius server and Squid proxy. & \\
\textbf{Ministry of Internal Affairs}, Middleware Engineer & 2018 -- 2019\\
• Prepared draft for technical documentation. & \\
• Managed users access in Oracle SQL database. & \\
\end{tabular}

\subsection*{\textbf{Open Source Experience}}
\label{sec:org57cfaee}
\begin{tabular}{p{14cm}}
\textbf{Curl} (\url{https://github.com/curl/curl})\\
• Enhanced Perl script to verify missing spaces in ternary operations.\\
• Modified code in accordance to coding style rules.\\
\\
\textbf{Ttyper} (\url{https://github.com/max-niederman/ttyper})\\
• Added option to disable backspace key.\\
• Added configuration to chage corners shape.\\
\end{tabular}



\subsection*{\textbf{Education}}
\label{sec:org57d3a42}
\begin{tabular}{{L{14cm}R{3cm}}}
\textbf{Military Technical Academy} & Bucharest\\
MA Telecommunications Engineering & 2020\\
• Developed wireless sniffer using Python and Scapy library. & \\
\textbf{Military Technical Academy} & Bucharest\\
BA Telecommunications Engineering & 2018\\
• Developed Snake 3D game in Visual Studio using C++. & \\
• Finished course about microcontrollers programming using mikroC. & \\
• Finished course about C programming basics.\\
\end{tabular}
\subsection*{\textbf{Technical Skills}}
\label{sec:orgc81d92f}
\begin{tabular}{l}
\textbf{Proficient Languages}: C/C++, Clojure, Go, \LaTeX{}\\
\textbf{Knowledgeable Languages}: Java, Lisp, Rust, Bash\\
\textbf{Tools}: Git, Linux, Emacs, Docker, Boost\\
\end{tabular}
\end{document}
